---
kind: method
id: M:Autodesk.Revit.DB.CurveByPointsArray.Append(Autodesk.Revit.DB.CurveByPoints)
source: html/2c6cea95-d43c-72e4-f0fe-4cfde39fd89a.htm
---
# Autodesk.Revit.DB.CurveByPointsArray.Append Method

## Syntax (C#)
```csharp
public virtual void Append(
	CurveByPoints item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.CurveByPoints`)